CREATE TABLE public.spr_ceha (
	nomer_ceha int4 NOT NULL,
	ceh_name text NULL,
	master_name text NULL,
	phone text NULL,
	CONSTRAINT spr_ceha_pkey PRIMARY KEY (nomer_ceha)
);
INSERT INTO public.spr_ceha (nomer_ceha,ceh_name,master_name,phone) VALUES
	 (1,'Подготовительный','Симатов Алексей Викторович','89520363652'),
	 (2,'Вулканизации','Лапшина Маргарита Ивановна','89520361258'),
	 (3,'Сборочный цех','Селезнёв Борис Евгеньевич','89520362574'),
	 (4,'Автокамерный','Семенов Олег Борисович','89520368451'),
	 (5,'Каландровый цех','Уваров Аркадий Петрович','89520367456');

CREATE TABLE public.spr_oborudovanie (
	nomer_oborudovaniya int4 NOT NULL,
	name_oborudovaniya text NULL,
	type_oborudovaniya text NULL,
	plan_power int4 NULL,
	CONSTRAINT spr_oborudovanie_pkey PRIMARY KEY (nomer_oborudovaniya)
);
INSERT INTO public.spr_oborudovanie (nomer_oborudovaniya,name_oborudovaniya,type_oborudovaniya,plan_power) VALUES
	 (6382,'Смеситель СКМ-2','Смеситель',50),
	 (741,'Агрегат подачи каучука','Агрегат',60),
	 (9536,'Конвейер №5','Конвейер',80),
	 (482,'Автомат накатки протектора','Автомат',45),
	 (3174,'Вулканизатор В-300','Вулканизатор',35),
	 (693,'Дозатор резины','Дозатор',70),
	 (6483,'Станок сборки покрышек','Станок',30),
	 (937,'Каландр четырёхвалковый К‑4В‑1500','Каландр',120),
	 (2516,'Пресс автокамер','Пресс',25),
	 (862,'Линия вулканизации №3','Линия',40);
INSERT INTO public.spr_oborudovanie (nomer_oborudovaniya,name_oborudovaniya,type_oborudovaniya,plan_power) VALUES
	 (7491,'Смеситель РС-1','Смеситель',55),
	 (385,'Конвейер сборки','Конвейер',75),
	 (9527,'Станок накатки','Станок',38),
	 (584,'Вулканизатор В-400','Вулканизатор',33),
	 (9163,'Смеситель-питатель СП‑250','Смеситель',80),
	 (372,'Дозатор добавок','Дозатор',65),
	 (6481,'Агрегат сборки шин','Агрегат',32),
	 (853,'Пресс формовки','Пресс',28),
	 (6843,'Линия вулканизации №1','Линия',37),
	 (3974,'Смеситель СКМ-3','Смеситель',52);
INSERT INTO public.spr_oborudovanie (nomer_oborudovaniya,name_oborudovaniya,type_oborudovaniya,plan_power) VALUES
	 (2915,'Конвейер транспортировки','Конвейер',78),
	 (7461,'Станок резки резины','Станок',42),
	 (735,'Вулканизатор В-500','Вулканизатор',36),
	 (5826,'Дозатор каучука','Дозатор',68),
	 (3194,'Охлаждающий барабан ОБ‑3','Барабан',110),
	 (872,'Агрегат сборки покрышек','Агрегат',34),
	 (6419,'Пресс формирования','Пресс',27),
	 (2753,'Линия вулканизации №2','Линия',39),
	 (4638,'Смеситель РС-2','Смеситель',53),
	 (1275,'Намоточное устройство НУ‑2М','Намоточный станок',100);
INSERT INTO public.spr_oborudovanie (nomer_oborudovaniya,name_oborudovaniya,type_oborudovaniya,plan_power) VALUES
	 (596,'Конвейер подачи','Конвейер',76),
	 (7382,'Станок формовки','Станок',40),
	 (8614,'Вулканизатор В-600','Вулканизатор',34),
	 (379,'Дозатор добавок','Дозатор',67),
	 (9427,'Агрегат сборки','Агрегат',33),
	 (1853,'Линия контроля толщины ЛКТ‑5','Контрольное оборудование',130),
	 (624,'Пресс автокамер','Пресс',26),
	 (5718,'Линия вулканизации №4','Линия',38);

CREATE TABLE public.tab_brak (
	date_obs timestamp NULL,
	nomer_ceha int4 NULL,
	nomer_oborudovaniya int4 NULL,
	smena text NULL,
	kol_godnyh int4 NULL,
	kol_braka int4 NULL,
	prichina_braka text NULL,
	CONSTRAINT fk_brak_ceh FOREIGN KEY (nomer_ceha) REFERENCES public.spr_ceha(nomer_ceha),
	CONSTRAINT fk_brak_oborudovanie FOREIGN KEY (nomer_oborudovaniya) REFERENCES public.spr_oborudovanie(nomer_oborudovaniya)
);
INSERT INTO public.tab_brak (date_obs,nomer_ceha,nomer_oborudovaniya,smena,kol_godnyh,kol_braka,prichina_braka) VALUES
	 ('2025-01-15 00:00:00.000',1,6382,'Смена_1',450,12,'Сырье'),
	 ('2025-01-19 00:00:00.000',1,741,'Смена_1',430,25,'Настройка станка'),
	 ('2025-01-24 00:00:00.000',3,9536,'Смена_4',800,5,'Человеческий фактор'),
	 ('2025-01-29 00:00:00.000',4,482,'Смена_4',460,8,'Сырье'),
	 ('2025-02-03 00:00:00.000',2,3174,'Смена_2',580,10,'Настройка станка'),
	 ('2025-02-08 00:00:00.000',1,693,'Смена_1',630,16,'Человеческий фактор'),
	 ('2025-02-13 00:00:00.000',3,6483,'Смена_2',490,7,'Настройка станка'),
	 ('2025-02-13 00:00:00.000',5,937,'Смена_2',620,3,'Сырье'),
	 ('2025-02-18 00:00:00.000',4,2516,'Смена_3',570,9,'Человеческий фактор'),
	 ('2025-02-24 00:00:00.000',2,862,'Смена_3',410,13,'Сырье');
INSERT INTO public.tab_brak (date_obs,nomer_ceha,nomer_oborudovaniya,smena,kol_godnyh,kol_braka,prichina_braka) VALUES
	 ('2025-03-01 00:00:00.000',1,7491,'Смена_2',350,11,'Сырье'),
	 ('2025-03-06 00:00:00.000',3,385,'Смена_2',256,17,'Сырье'),
	 ('2025-03-11 00:00:00.000',4,9527,'Смена_4',700,14,'Сырье'),
	 ('2025-03-15 00:00:00.000',2,584,'Смена_1',750,20,'Настройка станка'),
	 ('2025-03-15 00:00:00.000',5,9163,'Смена_4',590,22,'Настройка станка'),
	 ('2025-03-19 00:00:00.000',1,372,'Смена_4',680,19,'Настройка станка'),
	 ('2025-03-24 00:00:00.000',3,6481,'Смена_1',380,15,'Человеческий фактор'),
	 ('2025-03-29 00:00:00.000',4,853,'Смена_1',410,10,'Настройка станка'),
	 ('2025-04-03 00:00:00.000',2,6843,'Смена_3',220,8,'Сырье'),
	 ('2025-04-08 00:00:00.000',1,3974,'Смена_1',360,9,'Человеческий фактор');
INSERT INTO public.tab_brak (date_obs,nomer_ceha,nomer_oborudovaniya,smena,kol_godnyh,kol_braka,prichina_braka) VALUES
	 ('2025-04-14 00:00:00.000',3,2915,'Смена_2',450,16,'Настройка станка'),
	 ('2025-04-19 00:00:00.000',4,7461,'Смена_1',560,19,'Настройка станка'),
	 ('2025-04-24 00:00:00.000',2,735,'Смена_1',620,23,'Человеческий фактор'),
	 ('2025-04-29 00:00:00.000',1,5826,'Смена_2',710,25,'Настройка станка'),
	 ('2025-04-30 00:00:00.000',5,3194,'Смена_3',750,18,'Настройка станка'),
	 ('2025-05-04 00:00:00.000',3,872,'Смена_4',800,16,'Настройка станка'),
	 ('2025-05-09 00:00:00.000',4,6419,'Смена_4',540,14,'Настройка станка'),
	 ('2025-05-15 00:00:00.000',2,2753,'Смена_3',630,11,'Настройка станка'),
	 ('2025-05-19 00:00:00.000',1,4638,'Смена_2',340,15,'Настройка станка'),
	 ('2025-05-20 00:00:00.000',5,1275,'Смена_2',410,9,'Настройка станка');
INSERT INTO public.tab_brak (date_obs,nomer_ceha,nomer_oborudovaniya,smena,kol_godnyh,kol_braka,prichina_braka) VALUES
	 ('2025-05-24 00:00:00.000',3,596,'Смена_1',260,13,'Настройка станка'),
	 ('2025-05-29 00:00:00.000',4,7382,'Смена_1',550,17,'Настройка станка'),
	 ('2025-06-03 00:00:00.000',2,8614,'Смена_4',650,8,'Сырье'),
	 ('2025-06-08 00:00:00.000',1,379,'Смена_1',750,21,'Сырье'),
	 ('2025-06-14 00:00:00.000',3,9427,'Смена_1',570,26,'Сырье'),
	 ('2025-06-15 00:00:00.000',5,1853,'Смена_1',420,19,'Сырье'),
	 ('2025-06-19 00:00:00.000',4,624,'Смена_2',380,16,'Настройка станка'),
	 ('2025-06-24 00:00:00.000',2,5718,'Смена_1',290,13,'Настройка станка');


CREATE TABLE public.tab_prostoi (
	nomer_zapisi int4 NULL,
	date_start timestamp NULL,
	date_end timestamp NULL,
	nomer_oborudovaniya int4 NOT NULL,
	nomer_ceha int4 NULL,
	prichina_prostoya text NULL,
	cost_per_hour numeric NULL,
	CONSTRAINT tab_prostoi_pkey PRIMARY KEY (nomer_oborudovaniya),
	CONSTRAINT fk_prostoi_ceh FOREIGN KEY (nomer_ceha) REFERENCES public.spr_ceha(nomer_ceha),
	CONSTRAINT fk_prostoi_oborud FOREIGN KEY (nomer_oborudovaniya) REFERENCES public.spr_oborudovanie(nomer_oborudovaniya)
);
INSERT INTO public.tab_prostoi (nomer_zapisi,date_start,date_end,nomer_oborudovaniya,nomer_ceha,prichina_prostoya,cost_per_hour) VALUES
	 (1,'2025-01-01 08:00:00.000','2025-01-01 10:00:00.000',6382,1,'Ремонт',5000),
	 (2,'2025-01-05 09:00:00.000','2025-01-05 11:30:00.000',741,1,'Нет сырья',4500),
	 (3,'2025-01-10 10:00:00.000','2025-01-10 11:00:00.000',9536,3,'Пересменка',6000),
	 (4,'2025-01-15 14:00:00.000','2025-01-15 15:30:00.000',482,4,'Ремонт',5500),
	 (5,'2025-01-20 08:30:00.000','2025-01-20 09:30:00.000',3174,2,'Нет электроэнергии',7000),
	 (6,'2025-01-25 10:00:00.000','2025-01-25 11:30:00.000',693,1,'Пересменка',4500),
	 (7,'2025-01-30 09:30:00.000','2025-01-30 11:00:00.000',6483,3,'Ремонт',6500),
	 (8,'2025-01-30 09:30:00.000','2025-01-30 11:00:00.000',937,5,'Ремонт',6000),
	 (9,'2025-02-04 11:00:00.000','2025-02-04 12:30:00.000',2516,4,'Нет сырья',5000),
	 (10,'2025-02-10 08:30:00.000','2025-02-10 10:00:00.000',862,2,'Пересменка',7500);
INSERT INTO public.tab_prostoi (nomer_zapisi,date_start,date_end,nomer_oborudovaniya,nomer_ceha,prichina_prostoya,cost_per_hour) VALUES
	 (11,'2025-02-15 14:00:00.000','2025-02-15 15:30:00.000',7491,1,'Ремонт',5200),
	 (12,'2025-02-20 09:00:00.000','2025-02-20 10:30:00.000',385,3,'Нет электроэнергии',6300),
	 (13,'2025-02-25 10:00:00.000','2025-02-25 11:30:00.000',9527,4,'Пересменка',5100),
	 (14,'2025-03-01 08:30:00.000','2025-03-01 10:00:00.000',584,2,'Ремонт',7200),
	 (15,'2025-03-01 08:30:00.000','2025-03-01 10:00:00.000',9163,5,'Ремонт',5200),
	 (16,'2025-03-05 11:00:00.000','2025-03-05 12:30:00.000',372,1,'Нет сырья',4800),
	 (17,'2025-03-10 09:00:00.000','2025-03-10 10:30:00.000',6481,3,'Пересменка',6200),
	 (18,'2025-03-15 14:00:00.000','2025-03-15 15:30:00.000',853,4,'Ремонт',5300),
	 (19,'2025-03-20 08:00:00.000','2025-03-20 09:30:00.000',6843,2,'Нет электроэнергии',7100),
	 (20,'2025-03-25 10:00:00.000','2025-03-25 11:30:00.000',3974,1,'Пересменка',4700);
INSERT INTO public.tab_prostoi (nomer_zapisi,date_start,date_end,nomer_oborudovaniya,nomer_ceha,prichina_prostoya,cost_per_hour) VALUES
	 (21,'2025-03-31 09:30:00.000','2025-03-31 11:00:00.000',2915,3,'Ремонт',6100),
	 (22,'2025-04-05 11:00:00.000','2025-04-05 12:30:00.000',7461,4,'Нет сырья',5400),
	 (23,'2025-04-10 08:30:00.000','2025-04-10 10:00:00.000',735,2,'Пересменка',7300),
	 (24,'2025-04-15 14:00:00.000','2025-04-15 15:30:00.000',5826,1,'Ремонт',5600),
	 (25,'2025-04-16 14:00:00.000','2025-04-16 15:30:00.000',3194,5,'Ремонт',7100),
	 (26,'2025-04-20 09:00:00.000','2025-04-20 10:30:00.000',872,3,'Нет электроэнергии',6400),
	 (27,'2025-04-25 10:00:00.000','2025-04-25 11:30:00.000',6419,4,'Пересменка',5200),
	 (28,'2025-05-01 08:30:00.000','2025-05-01 10:00:00.000',2753,2,'Ремонт',7400),
	 (29,'2025-05-05 11:00:00.000','2025-05-05 12:30:00.000',4638,1,'Нет сырья',4900),
	 (30,'2025-05-06 11:00:00.000','2025-05-06 12:30:00.000',1275,5,'Нет сырья',5800);
INSERT INTO public.tab_prostoi (nomer_zapisi,date_start,date_end,nomer_oborudovaniya,nomer_ceha,prichina_prostoya,cost_per_hour) VALUES
	 (31,'2025-05-10 09:00:00.000','2025-05-10 10:30:00.000',596,3,'Пересменка',6500),
	 (32,'2025-05-15 14:00:00.000','2025-05-15 15:30:00.000',7382,4,'Ремонт',5700),
	 (33,'2025-05-20 08:00:00.000','2025-05-20 09:30:00.000',8614,2,'Нет электроэнергии',7500),
	 (34,'2025-05-25 10:00:00.000','2025-05-25 11:30:00.000',379,1,'Пересменка',4600),
	 (35,'2025-05-31 09:30:00.000','2025-05-31 11:00:00.000',9427,3,'Ремонт',6600),
	 (36,'2025-06-01 09:30:00.000','2025-06-01 11:00:00.000',1853,5,'Ремонт',6100),
	 (37,'2025-06-05 11:00:00.000','2025-06-05 12:30:00.000',624,4,'Нет сырья',5500),
	 (38,'2025-06-10 08:30:00.000','2025-06-10 10:00:00.000',5718,2,'Пересменка',7300);